In [8]:
import pandas as pd
d=pd.read_excel("duplicate.xlsx")
df=pd.DataFrame(d)
print(df)

        Name  Eng  Maths  Sci  Total
0        ali   33     56   77    166
1   nivedita   35     66   79    180
2    saksham   36     33   81    150
3      sonia   37     86   83    206
4   abhishek   38     96   33    167
5      rahul   39     33   87    159
6    abhinav   40    116   89    245
7   aliabbas   38     96   33    167
8   nivedita   35     66   79    180
9    saksham   38     96   33    167
10     sonia   33     56   77    166

In [9]:
df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8      True
9     False
10    False
dtype: bool

In [10]:
df.drop_duplicates()

        Name  Eng  Maths  Sci  Total
0        ali   33     56   77    166
1   nivedita   35     66   79    180
2    saksham   36     33   81    150
3      sonia   37     86   83    206
4   abhishek   38     96   33    167
5      rahul   39     33   87    159
6    abhinav   40    116   89    245
7   aliabbas   38     96   33    167
9    saksham   38     96   33    167
10     sonia   33     56   77    166

In [11]:
df=pd.DataFrame(d)
print(df)
df.drop_duplicates(inplace=True)
print(df)

        Name  Eng  Maths  Sci  Total
0        ali   33     56   77    166
1   nivedita   35     66   79    180
2    saksham   36     33   81    150
3      sonia   37     86   83    206
4   abhishek   38     96   33    167
5      rahul   39     33   87    159
6    abhinav   40    116   89    245
7   aliabbas   38     96   33    167
8   nivedita   35     66   79    180
9    saksham   38     96   33    167
10     sonia   33     56   77    166
        Name  Eng  Maths  Sci  Total
0        ali   33     56   77    166
1   nivedita   35     66   79    180
2    saksham   36     33   81    150
3      sonia   37     86   83    206
4   abhishek   38     96   33    167
5      rahul   39     33   87    159
6    abhinav   40    116   89    245
7   aliabbas   38     96   33    167
9    saksham   38     96   33    167
10     sonia   33     56   77    166